package com.office.example;

public class Multi3ArrayClass {
	
	public static void main(String[] args) {
		
		/*
		 * 3차원 배열 <- ["이미지 만들기"]
		 * 간단한 개념만 정리
		 * 
		 * int[][][] nums = new int[3][2][2];
		 */
		
//		int[][][] nums = new int[3][2][1];
//		nums[0][0][0] = 1;
//		nums[0][1][0] = 2;
//		nums[1][0][0] = 3;
//		nums[1][1][0] = 4;
//		nums[2][0][0] = 5;
//		nums[2][1][0] = 6;
//		
//		int[][][] nums = {
//				{{1}, {2}},
//				{{3}, {4}},
//				{{5}, {6}}
//			};
		
		//----------------------------------------------------------------
		
		// 학생번호 1번(1학기(국어, 영어, 수학), 2학기(국어, 영어, 수학), 3학기(국어, 영어, 수학)),
		// 학생번호 2번(1학기(국어, 영어, 수학), 2학기(국어, 영어, 수학), 3학기(국어, 영어, 수학)),
		// 학생번호 3번(1학기(국어, 영어, 수학), 2학기(국어, 영어, 수학), 3학기(국어, 영어, 수학)),
		// 학생번호 4번(1학기(국어, 영어, 수학), 2학기(국어, 영어, 수학), 3학기(국어, 영어, 수학))
		//  <- ["이미지 만들기"]

		
		int[][][] scores = {
				// 1번 학생
				{{80, 90, 100}, {90, 95, 85}, {85, 85, 90}},
				
				// 2번 학생
				{{90, 80, 85}, {90, 90, 85}, {95, 95, 100}},
				
				// 3번 학생
				{{95, 80, 100}, {100, 85, 100}, {100, 80, 90}},
				
				// 4번 학생
				{{85, 80, 100}, {90, 90, 95}, {100, 100, 80}}
		};
		
//		for (int i = 0; i < scores.length; i++) {				// 1차원 배열 순회
//			int[][] tempArr1 = scores[i];
//			
//			for (int j = 0; j < tempArr1.length; j++) {			// 2차원 배열 순회
//				int[] tempArr2 = tempArr1[j];
//				
//				for (int k = 0; k < tempArr2.length; k++) {		// 3차원 배열 순회
//					String str = "";
//					
//					switch (k) {
//					case 0:		// 국어
//						str = "국어";
//						break;
//						
//					case 1:		// 영어
//						str = "영어";
//						break;
//						
//					case 2:		// 수학
//						str = "수학";
//						break;
//					}
//					System.out.printf("%d번 학생 %d학기 %s 점수 : %d\n",
//							(i+1), (j+1), str, tempArr2[k]);
//				}
//			}
//		}
//		1번 학생 1학기 국어 점수 : 80
//		1번 학생 1학기 영어 점수 : 90
//		1번 학생 1학기 수학 점수 : 100
//		...
//		4번 학생 3학기 수학 점수 : 80
		
//		for (int i = 0; i < scores.length; i++) {
//			for (int j = 0; j < scores[i].length; j++) {
//				System.out.printf("\n============================\n");
//				System.out.printf("%d번 학생 %d학기 점수\n", (i+1), (j+1));
//				System.out.printf("\n----------------------------\n");
//				System.out.printf("국어\t영어\t수학\n");
//				System.out.printf("\n----------------------------\n");
//				for (int k = 0; k < scores[i][j].length; k++) {
//					System.out.printf("%d \t", scores[i][j][k]);
//				}
//				System.out.printf("\n============================\n");
//			}
//		}
////		============================
////		1번 학생 1학기 점수
////
////		----------------------------
////		국어	영어	수학
////
////		----------------------------
////		80 	90 	100 	
////		============================
////
////		============================
////		1번 학생 2학기 점수
////
////		----------------------------
////		국어	영어	수학
////
////		----------------------------
////		90 	95 	85 	
////		============================
		
	}

}
